RhinoInside.Revit API Documentation
GeometryEncoder.ToMesh Method (Brep)
 Converts the specified Rhino.Geometry.Brep to an equivalent of Autodesk.Revit.DB.Mesh.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Mesh ToMesh(
	this Rhino.Geometry.Brep brep
)
@staticmethod
def ToMesh(
	brep: Rhino.Geometry.Brep
) -> Autodesk.Revit.DB.Mesh
Parameters
brep
Type: Rhino.Geometry.Brep
Rhino brep to convert.
Return Value
Type: Autodesk.Revit.DB.Mesh
Revit mesh that is equivalent to the provided Rhino brep.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Brep. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToMesh(Brep) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Mesh revitMesh = rhinoBrep.ToMesh();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_mesh = rhino_brep.ToMesh()    # type: DB.Mesh
 Using ToMesh(Brep) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Mesh revitMesh = GeometryEncoder.ToMesh(rhinoBrep);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_mesh = GE.ToMesh(rhino_brep)    # type: DB.Mesh
See Also
Reference
GeometryEncoder Class
ToMesh Overload
RhinoInside.Revit.Convert.Geometry Namespace